---
kind: type
id: T:Autodesk.Revit.DB.Structure.LineLoad
source: html/ee5ec273-350a-1cdb-d136-0c454bb1446a.htm
---
# Autodesk.Revit.DB.Structure.LineLoad

An object that represents a force/moment applied in a linear manner.

## Syntax (C#)
```csharp
public class LineLoad : LoadBase
```

## Remarks
The load/moment may be uniform or it may vary between the two ends of the line.